/* Реализуйте и экспортируйте по умолчанию функцию, которая принимает на вход массив и возвращает новый массив,
полученный из исходного удалением повторяющихся элементов.

Исходя из смысла задачи, для получения результата над исходным массивом надо провести операцию фильтрации.
Для этого подходит метод arr.filter(predicate).
Метод arr.indexOf(value) можно "хитро" использовать для проверки дублирующихся значений. */

export default function uniq(array){
    function predicate(el, index){
        // то есть если на нынешнем индексе стоит проверяемый элемент,
        // а при поиске indexOf-ом такой же элемент не находится ещё на каком-то индексе
        return array.indexOf(el) === index;
    }
    return array.filter(predicate);
}

uniq([2, 1, 2, 3]); // [2, 1, 3]
//Взаимный порядок оставшихся элементов в новом массиве должен сохраняться.

uniq([2, 1, 2, 3]); // [2, 1, 3], a не [1, 2, 3] или не [3, 1, 2]

console.log(uniq([2,1,2,3]))
console.log(uniq([2,1,2,3,5,6,7,9,0,5,6,7]))