// Реализуйте и экспортируйте по умолчанию каррированую версию функции,
// которая принимает на вход три строки и возвращает новую строчку составленную из трех входных.

function concat(a){
    return function (b){
        return function (c){
                return a+b+c;
        }
    }
}

//------решение Учителя-----------
export default (str1) => (str2) => (str3) => `${str1}${str2}${str3}`;

// исходная версия
concat('a', 'bc', 'f'); // abcf

// каррированая версия
concat('a')('bc')('f'); // abcf