/*
Рассмотрим задачу представления отрезков на прямой плоскости. Каждый отрезок представляется как пара точек: начало и конец. Он может быть описан, например, так: [(1, 3), (5, 4)]. Это означает, что наш отрезок начинается в точке (1, 3) и заканчивается в точке (5, 4) координатной плоскости.

В этом задании необходимо разработать абстракцию для работы с отрезками (англ. segment), которая позволяет строить их из точек, извлекать из отрезков составные части (начало или конец отрезка), а также получать текстовое представление отрезка.

Абстракция заключается в том, что конкретное представление отрезка определяется внутри функций, описывающих работу с отрезками и зависит от создателя библиотеки. С точки зрения клиента библиотеки (кода который ее вызывает), не важно как конкретно устроен отрезок, важно только то, что есть некоторый набор функций (абстракция), позволяющий работать с ним.

Определите и экспортируйте следующие функции:

Конструктор makeSegment(), который принимает на вход две точки и возвращает отрезок. Первая точка это начало отрезка, вторая это конец.
Селекторы startSegment() и endSegment(), которые извлекают из отрезка его начальную и конечную точку соответственно.
Вспомогательную функцию segmentToString(), которая возвращает текстовое представление отрезка: [(1, 2), (-4, -2)].
Функцию midpointSegment(), которая находит точку на середине отрезка по формулaм: x = (x1 + x2) / 2 и y = (y1 + y2) / 2.
*/

import { makePoint, getX, getY, toString as pointToString } from '@hexlet/points';

function makeSegment(point1, point2) {
    return [point1,point2];
}

function startSegment(){

}

function endSegment(){

}

function midpointSegment(){

}

function segmentToString(segment){
    return [pointToString(segment[0]),pointToString(segment[1])]
}

// не важно, чем является segment с точки зрения реализации, главное, что с ним можно
// работать используя функции для работы с отрезками
const segment = makeSegment(makePoint(1, 2), makePoint(-4, -2));
console.log(segmentToString(segment)); // [(1, 2), (-4, -2)]

const point1 = startSegment(segment);
console.log(pointToString(point1)); // (1, 2)

const point2 = endSegment(segment);
console.log(pointToString(point2)); // (-4, -2)

pointToString(startSegment(segment)) === pointToString(makePoint(1, 2)); // true

pointToString(midpointSegment(segment)); // (-1.5, 0)