/*  Реализуйте стратегию, которая пытается заполнить поля,
пробегаясь построчно слева направо и сверху вниз (начиная с левого верхнего угла).
Как только она встречает свободное поле, то вставляет туда значение.

    Подсказки
    Нумерация строк и столбцов игрового поля должна начинаться с левого верхнего угла.
    Кто отвечает за состояние игры, и где оно должно храниться?
    Не мудрите с проверкой победителя, реализуйте эту логику в лоб      */

class Easy {
    // BEGIN (write your solution here)
    stepAI(field){ // от 0 до конца массива
        for (let i = 0; i < field.length; i++) {
            if(field[i] === '*'){
               field[i] = 'o';
               return
            }
        }
    }
    stepMan(field, v, h){
        const cell = 3*v + h;
        if(cell > -1){
            field[cell] = 'X';
        }
    }
    // END
}

export default Easy;