/*  Реализуйте стратегию, которая пытается заполнить поля,
пробегаясь построчно слева направо и снизу вверх (начиная с левого нижнего угла).
Как только она встречает свободное поле, то вставляет туда значение.

    Подсказки
    Нумерация строк и столбцов игрового поля должна начинаться с левого верхнего угла.
    Кто отвечает за состояние игры, и где оно должно храниться?
    Не мудрите с проверкой победителя, реализуйте эту логику в лоб.     */

class Normal {
    // BEGIN (write your solution here)
    stepAI(field){ // в обратную сторону
        const way = [6,7,8,3,4,5,0,1,2];

        for (let i = 0; i < way.length; i++) {
            let cell = way[i];
            if(field[cell] === '*'){
                field[cell] = 'o';
                return;
            }
        }
    }
    stepMan(field, v, h){
        const cell = 3*v + h;
        if(cell > -1){
            field[cell] = 'X';
        }
    }
    // END
}

export default Normal;